In [1]:
import numpy as np
import pandas as pd

In [7]:
df = pd.DataFrame({"col1":[1,2,3,4],
                  "col2":[444,555,666,444],
                  "col3":["abc","ghi","def","xyz"]})

In [8]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  ghi
2     3   666  def
3     4   444  xyz

In [10]:
df["col2"].unique()

array([444, 555, 666], dtype=int64)

In [11]:
len(df["col2"].unique())

3

In [12]:
df["col2"].nunique()

3

In [13]:
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [14]:
df["col2"].values

array([444, 555, 666, 444], dtype=int64)

In [15]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  ghi
2     3   666  def
3     4   444  xyz

In [16]:
df[df["col1"]>2]

   col1  col2 col3
2     3   666  def
3     4   444  xyz

In [17]:
df[(df["col1"]>2) & (df["col2"]==444)]

   col1  col2 col3
3     4   444  xyz

In [18]:
def times2(x):
    return x*2

In [19]:
df["col1"].sum()

10

In [21]:
df["col1"].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [22]:
df["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [24]:
df["col2"].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [25]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  ghi
2     3   666  def
3     4   444  xyz

In [26]:
df.drop("col1",axis=1)

   col2 col3
0   444  abc
1   555  ghi
2   666  def
3   444  xyz

In [27]:
 df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [28]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [29]:
df.info

<bound method DataFrame.info of    col1  col2 col3
0     1   444  abc
1     2   555  ghi
2     3   666  def
3     4   444  xyz>

In [30]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  ghi
2     3   666  def
3     4   444  xyz

In [31]:
df.sort_values("col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  ghi
2     3   666  def

In [32]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [34]:
data = {"A":["foo","foo","foo","bar","bar","bar"],
       "B":["one","one","two","two","one","one"],
       "C":["x","y","x","y","x","y"],
       "D":[1,3,2,5,4,1]}

In [35]:
df = pd.DataFrame(data)

In [36]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [37]:
df.pivot_table(values="D", index=["A","B"], columns="C")

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN